"""
言語処理100本ノック 第3章課題

34. 名詞の連接
名詞の連接（連続して出現する名詞）を最長一致で抽出せよ.

"""

text = []   # テキスト
sentence = []   # 文
 
with open("./assignments_folder/Chapter4/neko.txt.mecab", "r", encoding="utf-8") as f:
    for line in f:
        line = line.split("\t")     # タブ文字で分割
        if len(line) == 2:          # タブ文字の有無の判別
            line[1] = line[1].split(",")    # コンマで分割
            sentence.append({"surface": line[0], "base": line[1][6], "pos": line[1][0], "pos1": line[1][1]})    # 辞書追加
            if line[1][1] == "句点":    # 句点の場合，textにsentenceの一文を追加
                text.append(sentence)
                sentence = []


nouns = ""
nouns_set = set()

for sentence in text:
    for word in sentence:
        if word["pos"] == "名詞":
            nouns += word["surface"]
        else:
            if nouns != "":
                nouns_set.add(nouns)
            nouns = ""

# 出力確認
print(nouns_set)

"""
{'否', '頭梁', '七切', '完全', '本位', '偶像', '周囲', '時代思潮', '早口', '鍋中蛇', '水気', '無意識', '忠恕', '開き戸', '通町', '内御礼', '苦辛', '冥頑不霊', '境', '予審判事', '娑婆', '敬', '店', '殿下さま', '火鉢', 'や
る気', '瞳孔', '落日', '本気', '何点', '砲火', '一面識', '鄭寧', '当り前さ', '眼口', '矚目', '形容詞', '狂態', '江湖', '反覆', 'こないだ保険会社', '湯気', '東洋', '一座', '生涯三鞭酒', '袂', '二九', '面だらけ', '相場', 'ボールド', '用達', '十五番', '病院', '都合', '頻繁', '不当', '六十株', 'シモニジス', '適不適', '僕ら', '寸評', '到着', '屋敷', '鈴木将軍の', '肉食鳥', '渺々', '働き手', '人間全体', 'ナール', '紛々', '懇意', 'わ', '灰色', '待ち', '態度', '一気呵成', '尊敬畏服', 'きのう', '当時巡査', '身内', '監督', '小形', 'ナイス', 'お蔭', '天空海濶', '返答次第', '大部', '世態人情', '時姉', '一積極的', '存外自覚心', '越智こ', '吾輩自身', '雑煮事件', 'ゆ
き', '智者', 'ット', '表皮', '自他', '元朝', '東京市中', '土塀', '大人', '一寸参堂', '綿畠', '翌日食卓', '二頁', '方法', '先幾人', '三十一文字', '目', '甲斐', '役者', '木目', '的', '十二個', '長女', '巻煙草', '二三度飛鳥
', '出来損', '明治十一年九月廿八日', '金田令嬢', '口上', '地蔵さん', '金田君', '献立', '園遊会', '繁殖', '旻天', '十倍', '出で立ち', '大事', '性質', '車屋', '旧劇', '本会', 'ままどっか', '——差支え', '汝', '事情', '見性自
覚', '飴', '満腹', 'ひま人', '水葵', '険突', '頬', '天命', '一睡', 'これら', '幕', '悄々', '叔母さん', '水泳', '十七八', '通り独逸語', '日本女子裁縫', '定業', '碁', '植木屋', '海水', '希臘語', '一周', '語尾', '平板尨大', '容貌', '競', '拍子抜け', '一切寒月', '間然', '小生意気', '小間使', 'い', '顫', 'ッ', '望み通り僕', 'がち', '狂瀾', '独逸語', '詩', '貯金', '度', '家屋', 'たんび', '余裕', '非難', '一句毎', '縄ぐるみ', '邸内', '実業家贔
負', '凱歌', '懸命', '水仙', '半可通', 'みんな後ろ', '間違い', '体育', '塩風', '手詰', '椽側', '野獣', '何百遍', '話頭', '内材料', 'ゃごおうにゃごおうと三度目', '日記', '接近', '大町桂月', 'かかり', '年齢', '可哀相', '成
下候', '君方', '睹', 'たまえ', '古今', '如是観', '長範', '顋', '襟髪', '福', '百年目', '次郎ちゃん', '下手', '鈴木藤十郎君', 'シャンパン', '真中', '鞘払', '四時前', 'イヨー大分', '舞踏', 'うちじゅう', '猛虎', '口づけ', 'お貰い', '紙', '戦闘線内', 'ぴん', '候次第', '神様', '職人', 'まま室内', '苦労', '療法', 'キュー', '金箔', '餌食', '道', '天井裏', '——先生', '危き', '坊さん', '四口', '逃', 'ダムダム弾', 'まま細君', '獅鼻', '流俗', '廃そ
う', '縮緬', '一字一句', '煽動', '煩悶', 'あか', 'なに猫', '二足', '竿', '主人一人', '糸瓜', '母堂', '曲淵', 'そこら', '事骨抜', '七輪', '口調', '当惑', '奔走努力', 'そば', '忙中自ら閑', 'ご用', '閉口', '自信致候', '落第
', '女客', '一畳', '霊物', 'ため鼻', '高山彦九郎', '生活上', '細胞', 'スペイン', '愛嬌もの', '結婚事件', '迷乱', '先生大', '一つ穴', '二口三口', '合せ', '同意', '訳合', '防禦策', '茶羅ッ鉾', 'みんな一度', 'ありがた味', '蒙昧', '夕べ泥棒', '長生き', '以', '送籍', '眷顧', '辛抱', '廃絶', '埃及煙草', '大鵬', 'ページ', '臆病者', 'お待ち', '三拝', '疑い', '大概自殺', '対面', '竜文堂', 'ごろごろ', '利息', '野暮', '皮肉', '時間', '服薬', '天真
爛漫', 'この間深夜', 'ついで', '呉絽', '一生涯', '全て', '当て', '母堂様', '鈴木さん', '息子', '先生何', '功', '段奉賀上候陳', '背', '恃むまじきを恃', '膳椀皿小鉢', 'きが', '談話', '一軒家', '言葉ちがい', '田舎もの', '昼
間', '一二町', '君シャンパン', '器量', '古井何とか', '大悟', '一人前', '思惟', '天女', '我理', '集合体', '拳骨', '弁当', '玉子', '十何年', '——今度東京勤務', '不満', '効果', '樽木', '毎晩竹刀', '横向き', '近辺', '捕獲', '路頭', '辛防', '諷刺的', '其節', '美感', '手つき', '毎月毎月勘定', 'ホホホホ', '反射作用', '素直', '万里', '大変賑やか', '十分理解', '寒月流', '歌留多会', '迷亭君いつ', '雲照律師', '先達てカーテル・ムル', '救', '据', '産
物', '名産吉備団子', '以下略', '牧山さま', '二六時中精細', '全智全能', '退屈そう', '眼下', '多量', '沢山拝見', '博士論文', '空漠', '文学博士', '三女', '師弟', 'ダムダム', '浄瑠璃', '混同', '半径', '閑中自ら忙', '語', '無
作法', '終日書斎', 'たいがい常識', '人為的', '美麗', '社会的現象', '分', 'だし', '電動作用', 'ストライキ', '欧洲人こと', '屈竟', '事気', '着物', '冷暖', '素町人', '中途', '研究', '調和', 'ごろつき手', '理想的', '結構', '嬢様', 'さ三尺', '一二滴眼尻', '二本引き三本', '説明', '幸福さ', '易水', '失笑', '水', 'いびつ', '模様画', '問題', '釣り段', '懸賞的興奮剤', '技術', 'ご飯', '——彼等希臘人', '親切', '野蛮', '才人', '灰吹きが', '生長', '短
歌会', '管轄内', 'ミイラ', '頓挫', '併発', '原', 'これぎり', '奇問', '先君', 'おのれ', '日当', '四膳', '柔道', '三味線', '訓練', '失恋', 'あなた真面目', '瘧', '○○子さん', '両方', '右向', '何とか', '参酌', '僕', '尼', '浪
', '豪気', '望通り', '慥', '野良犬', '愚人', '桐', '恐く', '寄合', '社交上', '悪漢', '汽船', '営養不足', '実業家諸君', '雨', '内部', '三日月形', '日暮れ方', 'しか', '奇言奇行', '伯父さん苦沙弥君', '見境', '清聴', '択', '比喩', '波瀾', '怒号', '骨', '八十', '——いや身分', '午睡', '弾道', '悟りよう', '起居', '一口', '随意', '煙', '風船玉', '成下度', '前進', '空缶', '大変都合', '力学的', 'たち', '殺気', 'メンチボー', '朱泥', '何物たる', '湯
壺', '私しゃ', '寄附金', '休養', '落雲館裏八百', 'それ限り', '干瓢', '応用', '猫', '目下文明', '日影', 'ざる化装道具', '仏国革命史', '奥さん蕎麦', '両端', '小倉', '毬栗頭', '寺', '消極', '四五通', '宝', 'フン', '梅花形', '二尺', '会合', '越智東風君', '家内総がかり', '監督組', '苦心惨憺', '一張来', 'みんな退校', '神酒供え', '蹲踞まり', '言詮', '僥倖', '署名', '——爆発', '訓義', 'シチュ', '毬', '吾物顔', '網羅', '寿命', '裡', '一度目', '二
十四五', '寒月先生自身', '長州征伐時代', '命令', '当座間に合せ', '演習', '手前', 'うの', '題', '無用', '生れ', '藤村', '描写', '集中', '風波', '是非元', '蝦蟆', 'さまざま', '三助', '夜', 'よっぽど人', '居', '金田さん', 'ほととぎす', '騒動', '通りどこ', '恨事', '破裂', '勾配', '多情', '憚りさま', '暖か', '鉄扇鉄扇', '十文字', '下度候', '再考', '旧', '上不思議', 'めん', '針箱', '二三片', '任意これ', '一隊', 'タマス・ナッシ', '九年目', '吾
身', '忘年会兼合奏会', '怺', '天道公平君万歳', '内', '焼打以上', '明星', '身投げ', '大分苦心', '察し', '鞭撻', '君ただ', '先生胃病', '出入', '変り者', '亭主', '頑固光沢消し', '注文通り二叉', '火燵櫓', '戸迷', 'お客', '三
千人', '彼女', '危険', '本文', '日課', '幾缶', '手製', '眼鏡越', 'フロックコート', '鉄気', '紫外光線', '何有郷', '三四分', '一時', '三句', '袴期', '道場', '種族', '全体', '怪', '——たま', '想像', '見地', 'せんだってコロン
バス', '下等', '凭', '重要', '覚禅師', '我物顔', '女学生', '一七日', '動物', '法とり', '話し声', 'フ', '手懸り', '春夏秋冬一枚看板', '五六分', '恰好', '宇宙的', '後ろ向', '通り鵯越', '疲労', '冷淡', '即座', '足台', 'せん
だって日本新聞', '地面', '永眠', '天才呼ばわり', '穏当', '十八目', 'スミス等諸家', '若竹', '腕力', '都', 'いずれ', '四つ足', '(1)T2cos', 'ぶん', '大袈裟', '髷', '雨戸', '鶉', '開き', '摩擦', '一歩向', '嘔吐', '半ば', '濠
', '自炊', '庭中', 'ポン', '当年', '古着屋', '宮殿下', '金縁', '候事', '覚', '今後共', 'むき出し', '今日中学程度以上', '誤り', '蔭弁慶', '玄妙不思議', '煖', '悟', '衣', 'ゆうべ', '君', '豪傑', '昨年', '自然薯', '屋賃', '蛇', '初対面', '心置き', '中味', 'レール', '万朝', '手紙', '講筵', '鈴木藤十郎', '左右', '五分', '光来', '車', 'なめくじ', '是非共二三十羽', '朝夕', '法螺吹', '悪寒', 'その後二絃琴', '二度目', '極楽主義', '模写模型', '習
い', '鳴き声', '戸口', 'レンブラント', '組織', '田圃', '利害', '水島君', '製造元', '俗気', '御座', 'ジョーンス', '驢馬', '芸', '居候', '躄', '善人', '壮士', '味噌汁', 'んざあ', '絶後', '場', '先生——', '御前の', '消毒器', '隠れ家', '東西館', '父母', '奇警', '戦死', '糸', '御用達', '四五人小僧', '売品', 'マン', 'ゴワゴワ', '四つ目垣', '一瓢', '通り今', '放逐論', '芝居がかり', '懐旧談', '四日目', '御宮', '皺', '一位', '護謨管', '圧迫', '云
い草', '終日', '馬肉', '馬鹿野郎', '昂然', '薄っぺら', 'かん徳利', '善し悪し', '頓着', '大分', 'すね', '一番嫌', '人間自然', '果報者', '木登り', '潮', '羅馬', '奇談', '欠け目', '企て', '行李', '水彩絵具', '書', '一団体', '爵禄', '名目よみ', '脱俗超凡', '遣手', '此入浴嘔吐', '谷あい', '真面目そう', 'レオナルド・ダ・ヴィンチ', '今頃人', '引用', '一同', '東風君一人', '福地キシャゴ', '頓痴奇', '皮', '馬琴', '十', '大分年', '使役', '寸法', '神経衰弱', '毎日喧嘩', '保険', '青大将', '突ッ', '冬', '一喝', '権限', '線香', '勤勉家', '肝胆', 'あちら', '利目', '夕', 'すべて曖', '通り手のひら', 'るい', '抱え車夫', '陰士', '沈澱党', '伺い', '出掛', 'ジェームス', '交
ら', '影', '悪', '珍宝', '毛中', '眼鼻', '積極', '食卓', '日本派', '当世流', '太人', '天晴', '二方法共実行', '人様', '街鉄', '大抵一隊', '矛盾', '遶', 'だれ', '生死事大', '一辺', '三丁目', '円滑', '参考', '屈従', '専門的
知識', '純粋', '勘左衛門', '汁粉', '原理', '一夜', '層', '古来欧洲人', '出処', '静坐', '絞首架', '鍔元', '一匹', '今度', '意気込', '平手', '両立', '青空', '忠臣蔵', '伝声', '孤灯', '友某', '五', '世界何億万', '診断', '端
緒', '扁鵲', '庚申山一面', '狐', '恭賀新年', '謀叛', '——猫', '不評判', '阿呆', '無地', '牛鉄心', '誤解', '際諸君', '愚考致候', 'なに学校', '家賃', '以上', '是非固形体', 'あなた', '虞', '商買道具', '山芋', '断り', '——幸い
ヴァイオリン', '可哀そう', '薩摩飛白', '先刻主人', '安眠', '遠征', '倒行', 'せんだって細君', '按腹揉療治', '握り飯', '今日半日', 'ようす', '世界向後', '水力電気', '四肢', '心持', '午後一時', 'いらいら', 'たき殻', '無邪気
', '小声', '天地開闢以来吾輩', '昼飯後', '峠', '強力', '兄', '鋸様', '苟め', '時事問題', '上級生', '弘法大師', '炎熱', '溺', '沓脱', '人民', 'そちら', 'この間', '一竿風月閑生計', '戯曲家', '母親', '悠々閑々', '見合', '日
例', '人足', '従容', '曖', '言葉使い', '著述', '三口', '一週三度', '閉鎖', '奉職', 'ばかよう', '不利', '蓮池', '天地万有', '品数', '至誠', '取締', '窮措大', 'もろ肌', 'ピヤース・プローマン', '楷梯', '大分骨', '慰藉', '通
称', '異様', '全体どこ', '二大厄', '超絶的曲線', 'まま奥', '茶番', '払底', '高輪泉岳寺', '洗湯', '金柑', '哲理', '厄介', '待', '冷水', '硝子鉢', '冬空', '果敢', '志望通り', '疳違い', '胆', '琉球塗', '厚遇', '掛矢', '尊公
', '左肺', '生涯人間中', '彼等人間', '店先', '十年前学校', '毛脛', 'ご苦労千万', '沈吟', '年々', '五本', 'たくさん', 'かしこ', '超然', '瞬間', '乗り手', '白痴', '友愛', '放蕩', '素琴', '悟道', 'まなこ', '仏陀', '乱暴', '十七味調唐辛子調', '原稿紙', '鬼窟裏', '欲', '理野陶然', '訳', '心中物', '今度ここ', '最前細君', 'さ加減', '五銭', '三番目', '長大', 'ポカーン', '君の', '賦税', 'ゃもじの上', '間男', '中止', '普通の', '場所', '——いや', 'あと足', 'ご無沙汰', '空間', '批評眼', '九月', '懇願', 'しみ', '秘法', '当り前さ結論', 'ぎかけたるごとく', '夫', '平面', '推して知るべし', '家名', '失望', '九拝', '喧嘩', '社会的動物', '朗らか', '意気銷沈', '衛生', '注意
', '人', '西洋館', '富子令嬢', '沙河', '迷惑', '日蓮', 'ただ声', '曝ら', '鮭', '中形', '素晴', '面長', '身代り', '為め其意', '著書', '客さま', '何これ', '一挙両得', '十日', '酷', '焼酎', '入籍', 'もっとも集', '充満', 'ほ
んとう', '鉄砲丸', '滔々', '目縁', '胴体', '夏蜜柑', '団扇', '二十四時間', '吐月峰', '真理', '理論上', '先生たいがい', '二巻', '片割れ', '大分減', 'からかい', '火事', '習癖', '昏睡仮死', '不明', '頭——頭', '使', '日帰り', '薄気味', '越中褌', '愚昧', '爺さん', '羅', '這裡', '毬栗先生', '絵画', '大分群', '疝気', '二年越し', '乾', '銀製', 'ハンニバル', '不道徳', '先生一', '無気味', '灯心入り', '自分達', '水甕', '傍ら', '沙弥先生', '陵', '煩
', '立腹', '心丈夫', '海老', '外界', '重役', 'パスカル', '坂本竜馬', '恩', '一意戦闘', '音曲', '引け', '一段落', '祟り目', '多角性', '結果今日', '一杯ビール', '独仙君', '艶', '混成猫旅団', '種類如何', '裸体', '虎蔵君', '発揚', '官女', '千鳥', '己霊', '看破', '不思議', '曲線', '辛棒', '憺溟濛', '二目', 'おだやか', '逆上的敏腕', '貧乏人', '任意', '我々未婚', '今度寒月', '嚢中', '元信', '五六本併', '水彩画家', '地獄', '二時十分前', '八時', '喇叭節', '不完全', '坊ばちゃん', '今頃', '五杯目', '横丁', '文壇', '間板', '混乱', '令嬢', '新体詩', '人文', '位牌', '以太利', '奈良', '二三日前年始', 'おれなんざ', '埒', '大概ここ', '種属', '文字', 'スタンラン', '蒸籠
', '平均性理論', '活動紙幣', '鉄棒', '考案', '高', '帰り', '事——これ', '間毎月十円', '博士', '長吉', '今日等', '一日記', '穏かな日', '以太利亜', '余計', '一杯目', '時候', '衝', '切', '消耗', '美譚', '動揺', '間あいつ', '三度目', '吐呑', '於', '具合', '欠乏', '袴', '絶対', '周囲附近', '互', '半分', '妙詩', '女房なんど', '人さし指', '失策物語', '——」「誰だい', '紋', '上日記', '独身', '天文学者', '宿', 'なに本', '竈', '候節', '処置', '五感
', 'ヘクトー', '動悸', '法螺', '西洋手拭', 'ケニルウォース', '旅順椀', '歓喜何もの', '早分り', '鴨南蛮', '小刀細工', '六十一回', '皆団扇', '心眼', '実用上', '仰山', '利口者', 'ハハハハ私', '臨時気違', '性急', 'ハハハハそ
う', '大変珍重', '堂陲', '情線', '気転', '花魁', '県', '一彼', '感投詞', '月末', 'ばってん', 'その後御宮', '一信', '甘木さん', '夕飯', '磔', '画家', '弾丸', '博物館', '分界線', '辛苦', '粛然', '秩序', '埃及人', '刹那', '買収', '福地さん', '東風', '竹葉', '是非共ここ', '幅三尺八寸高', '達者', '有望', '妻子', '好奇', '金銭', '一面', '始', '申上候', '唾', '製作', '華厳滝', '同一視', 'せい', '真一文字', 'ガラス玉', '父祖', '撲殺', '釘付', '馬鹿大名', '御両人', '元来意地', '素袷', '精読', 'クレオパトラ', '電話口', '事——', '当夜煢', '——蟷螂狩り', '本因坊', '毎晩二三杯', '蔭', '森々', '兎さん', '挙ぐる', '盗', 'いく篇', '護身服', '鼾', '此際吾人西洋', '手廻し
', '一メートル', '一通り障子', 'そっちのけ', '吾等猫', 'アハハハそうそう坊主', '次', '拷問', '成道', '掃除', '曰く付き', '蒟蒻', '家業', '繁昌', '時計', '進上', '二十七', '刺物', '入浴後一種', '鳥屋抔', '合点', '一あなた
', '受', 'ぐたぐた', '犬', '爪', '逸事', '冽', '
"""



"""
―リーダブルコードの内容で実践したこと―
・p.171～p.173の「短いコードを書くこと」で，
リスト内包表記を使って、コンパクトで読みやすいコードを実現しています。
イギリスに関する記事を取得する際、filterとlambdaを使って処理を行っています。これにより、1行で必要なデータを抽出できます。

・p.10の「2.1 明確な単語を選ぶ」で，
変数名やコメントに明確な単語を使っています。例えば、"folderpath"や"filename"は、そのまま読んで意味が理解できる名前です。
"UK_article"という変数名は、イギリスに関する記事を表すため、そのままの名前を使用しています。

"""